## Plan 📝
```bash
google_storage_bucket.terraform_state_bucket: Refreshing state... [id=apsitvarkom-dev-bucket-tfstate]
data.google_iam_policy.noauth: Reading...
google_service_account.ga_cd_account: Refreshing state... [id=projects/apsitvarkom-dev/serviceAccounts/ga-delivery@apsitvarkom-dev.iam.gserviceaccount.com]
google_artifact_registry_repository.docker_repo: Refreshing state... [id=projects/apsitvarkom-dev/locations/us-east1/repositories/docker-apsitvarkom-dev]
google_cloud_run_service.be_service: Refreshing state... [id=locations/us-east1/namespaces/apsitvarkom-dev/services/apsitvarkom-be]
data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_project_iam_member.artifact_registry_repo_admin_ga_cd_binding: Refreshing state... [id=apsitvarkom-dev/roles/artifactregistry.repoAdmin/serviceAccount:ga-delivery@apsitvarkom-dev.iam.gserviceaccount.com]
google_project_iam_member.token_creator_ga_cd_binding: Refreshing state... [id=apsitvarkom-dev/roles/iam.serviceAccountTokenCreator/serviceAccount:ga-delivery@apsitvarkom-dev.iam.gserviceaccount.com]
google_project_iam_member.cloud_run_admin_ga_cd_binding: Refreshing state... [id=apsitvarkom-dev/roles/run.admin/serviceAccount:ga-delivery@apsitvarkom-dev.iam.gserviceaccount.com]
google_cloud_run_service_iam_policy.be_service_noauth: Refreshing state... [id=v1/projects/apsitvarkom-dev/locations/us-east1/services/apsitvarkom-be]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_service.be_service will be updated in-place
  ~ resource "google_cloud_run_service" "be_service" {
        id                         = "locations/us-east1/namespaces/apsitvarkom-dev/services/apsitvarkom-be"
        name                       = "apsitvarkom-be"
        # (4 unchanged attributes hidden)

      - template {
          - metadata {
              - annotations = {
                  - "autoscaling.knative.dev/maxScale"  = "100"
                  - "client.knative.dev/user-image"     = "us-east1-docker.pkg.dev/apsitvarkom-dev/docker-apsitvarkom-dev/apsitvarkom-be:latest"
                  - "run.googleapis.com/client-name"    = "gcloud"
                  - "run.googleapis.com/client-version" = "405.0.0"
                } -> null
              - generation  = 0 -> null
              - labels      = {} -> null
              - name        = "apsitvarkom-be-00002-xul" -> null
            }

          - spec {
              - container_concurrency = 80 -> null
              - service_account_name  = "233600840849-compute@developer.gserviceaccount.com" -> null
              - timeout_seconds       = 300 -> null

              - containers {
                  - args    = [] -> null
                  - command = [] -> null
                  - image   = "us-east1-docker.pkg.dev/apsitvarkom-dev/docker-apsitvarkom-dev/apsitvarkom-be:latest" -> null

                  - env {
                      - name  = "ASPNETCORE_ENVIRONMENT" -> null
                      - value = "Development" -> null
                    }

                  - ports {
                      - container_port = 80 -> null
                      - name           = "http1" -> null
                    }

                  - resources {
                      - limits   = {
                          - "cpu"    = "1000m"
                          - "memory" = "512Mi"
                        } -> null
                      - requests = {} -> null
                    }
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service.fe_service will be created
  + resource "google_cloud_run_service" "fe_service" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "us-east1"
      + name                       = "apsitvarkom-fe"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
          + tag             = (known after apply)
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service_iam_policy.fe_service_noauth will be created
  + resource "google_cloud_run_service_iam_policy" "fe_service_noauth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "us-east1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = (known after apply)
      + service     = "apsitvarkom-fe"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
<!-- Sticky Pull Request Commentplan -->